Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionPlacingAttributes Constructor
 Creates a new dimension placing attributes instance. The placing is set to the free placing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionPlacingAttributes()
Public Sub New
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
DimensionSetBaseAttributes.DimensionPlacingAttributes Overload
Tekla.Structures.Drawing Namespace